In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
df = sns.load_dataset('titanic')
tdf = df.copy()
tdf2 = df.copy()
tdf.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Q. titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 df를 만드세요

In [14]:
df1 = df.loc[:,['age','fare']]
print(df1,type(df1))

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns] <class 'pandas.core.frame.DataFrame'>

### Q. 10을 더하는 함수 add_10 과 두 객체의 합 add_two_obj 함수를 정의한 후 결과값이 각각 20과 20을 출력하세요.

In [91]:
def add_10(df):
    return df + 10
def add_two_obj(a,b):
    return a+b

print(add_10(10))
print(add_two_obj(10,10))

20
20

### Q. 10을 곱하는 사용자 함수와 두 객체의 나눗셈을 수행하는 사용자 함수를 정의한 후 결과값이 각각 200과 10을 출력하세요.

In [92]:
def mul(a):
    return a * 10
def div(a,b):
    return round((a/b),2)

print(mul(20))
print(div(100,10))

200
10.0

### Q.df_age 에 add_10 함수를 적용해서 출력하세요.

In [93]:
df_age = df['age']
print(df_age,'\n')
sr1 = df_age.apply(add_10)
print(sr1.head())

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

### Q. 시리즈 객체 + 숫자를 연산하는 방식으로 df.age에 10을 더한 후 sr2에 저장하고 출력하세요.

In [94]:
print(type(df_age)) # 시리즈 타입인거 확인하고 
sr2=df_age+10 # 문제 처럼 그냥 시리즈 객체 + 숫자 하니까
sr2 # 연산이되네?

<class 'pandas.core.series.Series'>

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

### Q. 람다 함수를 활용해서 위와 같은 연산을 수행하고 결과를 sr3로 출력하세요.

In [95]:
sr3 = df.age.apply(lambda x : add_10(x))
sr3

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

### Q. df의 'age', 'fare' 칼럼에 10을 사칙연산하는 사용자 함수를 정의하고 applymap()으로 각 사용자 함수를 매핑한 후 출력하세요.

## df4는 age로 데이터프레임화 했음

In [113]:
# df_map = df.applymap(add_10)
df4 = df.loc[:,['age','fare']] 
df_map = df4.applymap(add_10)
print(df_map)

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [87]:
# def add(df):
#     return df + 10
# def mul(df):
#     return df * 10
# def sub(df):
#     return df - 10
# def div(df):
#     return round(df/10),2
# df4 = df.loc[:,['age']] 
# print(df4.head(),'\n')
# print(df4.applymap(add).head())
# print(df4.applymap(mul).head())

# applymap 은 dataframe 기반 , map()은 Series 기반

### Q. df_map의 [0,0]을 NaN으로 변경한 후 missing_value 함수를 적용해서 불린 시리즈를 반환하세요.

In [114]:
def missing_value(series):
    return series.isnull()

df_map=df_map.replace([0,0],np.nan)

result = df_map.apply(missing_value)
print(result)

       age   fare
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]

### Q. titanic 데이터셋을 seaborn에서 로딩한 후 블린 인덱싱을 이용하여 아래 사항들을 수행하세요.
- 나이가 10대(10~19세)인 승객만 따로 선택
- 나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택
- 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택

In [128]:
# tdf2.head()
# 10대 애들 뽑기
age1 = (tdf2.age >= 10) & (tdf2.age<20)
df_teen = tdf2.loc[age1,:]
print(df_teen.head())

    survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
9          1       2  female  14.0      1      0   30.0708        C  Second
14         0       3  female  14.0      0      0    7.8542        S   Third
22         1       3  female  15.0      0      0    8.0292        Q   Third
27         0       1    male  19.0      3      2  263.0000        S   First
38         0       3  female  18.0      2      0   18.0000        S   Third

      who  adult_male deck  embark_town alive  alone
9   child       False  NaN    Cherbourg   yes  False
14  child       False  NaN  Southampton    no   True
22  child       False  NaN   Queenstown   yes   True
27    man        True    C  Southampton    no  False
38  woman       False  NaN  Southampton    no  False

In [134]:
# 영아 이면서 여아 뽑기
age2 = (tdf2.sex == 'female') & (tdf2.age<10)
df_zero = tdf2.loc[age2,:]
print(df_zero.head())

     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
10          1       3  female  4.0      1      1  16.7000        S   Third
24          0       3  female  8.0      3      1  21.0750        S   Third
43          1       2  female  3.0      1      2  41.5792        C  Second
58          1       2  female  5.0      1      2  27.7500        S  Second
119         0       3  female  2.0      4      2  31.2750        S   Third

       who  adult_male deck  embark_town alive  alone
10   child       False    G  Southampton   yes  False
24   child       False  NaN  Southampton    no  False
43   child       False  NaN    Cherbourg   yes  False
58   child       False  NaN  Southampton   yes  False
119  child       False  NaN  Southampton    no  False

In [3]:
# 10 이하 60 이상
age3 = (tdf2.age >= 60) | (tdf2.age<10)
df_three = tdf2.loc[age3,['age', 'sex', 'alone']]
print(df_three.head())

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

## Q. 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 alone 열만 선택한 후 값을 True로 변경하세요

In [10]:
tdf3 = df.copy()
df_m3 = tdf3.loc[(df.age < 10)|(tdf3.age>=60),'alone']
print(df_m3[:5])
tdf3.loc[(tdf3.age < 10)|(tdf3.age>=60),'alone'] = True
print(df_m3.head())

7     True
10    True
16    True
24    True
33    True
Name: alone, dtype: bool
7     True
10    True
16    True
24    True
33    True
Name: alone, dtype: bool

### Q. 최대값 - 최소값을 반환하는 사용자 함수를 min_max로 정의하고 age, fare 열로 구성되는 타이타닉 데이터프레임df 에 적용하여 결과와 자료형을 출력하세요. source : titanic = sns.load_dataset('titanic')

### Q. df 에서 'age' 칼럼과 'fare'칼럼을 더한 가격을 리턴하는 사용자 함수를 정의한 후 df['add'] 변수를 생성하여 출력하세요.(lambda 함수 사용)

In [15]:
def add_two_obj(a,b):
    return a+b
df1['add']=df1.apply(lambda x:add_two_obj(x['age'],x['fare']),axis=1)
df1.head()

    age     fare       add
0  22.0   7.2500   29.2500
1  38.0  71.2833  109.2833
2  26.0   7.9250   33.9250
3  35.0  53.1000   88.1000
4  35.0   8.0500   43.0500

### Q. 'age', 'fare' 두개 칼럼으로 구성되는 titanic 데이터프레임에서 [0,1]의 값을 NaN을 변경한 후 df 이름으로 출력하세요.

In [16]:
df1.iloc[0,1] = np.nan
df1.head()

    age     fare       add
0  22.0      NaN   29.2500
1  38.0  71.2833  109.2833
2  26.0   7.9250   33.9250
3  35.0  53.1000   88.1000
4  35.0   8.0500   43.0500

### Q. 각 열의 NaN 찾기, 각 열의 NaN 개수 반환, 데이터프레임의 총 NaN 개수를 반환하는 사용자 함수를 정의한 후 df.pipe 메소드로 함수 매핑한 결과를 모두 출력하세요.

In [18]:
def findn(a):
    return a.isnull()
def sumnan(a):
    return a.isnull().sum()
def sumnanall(a):
    return a.isnull().sum().sum()

df5 = df.copy()
display(df5.pipe(findn).tail(5))
print(df5.pipe(sumnan),'\n')
print(df5.pipe(sumnanall))

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,add
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False,True
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False,False

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
add            177
dtype: int64

1046

### Q. 타이타닉 df의 열 순서를 아래와 같이 재구성하고 출력하세요
* 열 선택 : ['pclass', 'sex', 'age', 'survived'].
* 열 이름의 리스트 만들기
* 열 이름을 알파벳 순으로 정렬하기
* 열 이름을 기존 순서의 정반대 역순으로 정렬하기
* 열 이름을 사용자가 정의한 임의의 순서로 재배치하기

In [27]:
dft = sns.load_dataset('titanic')
ttdf = dft[['pclass', 'sex', 'age', 'survived']]
# 이런 방법도 있다

list(dft.columns)

columns = list(dft.columns)
columns_sorted = sorted(columns)
dft_sorted = dft[columns_sorted]
print(dft_sorted.head())

# columns_reversed = list(reversed(columns))
# dft_reversed = dft[columns_reversed]
# print(dft_reversed.head())
# 뭔가 이상하다 이거 

columns_customed = ['pclass', 'sex', 'age', 'survived']
dft_customed = tdf[columns_customed]
print(dft_customed.head())

   adult_male   age alive  alone  class deck  embark_town embarked     fare  \
0        True  22.0    no  False  Third  NaN  Southampton        S   7.2500
1       False  38.0   yes  False  First    C    Cherbourg        C  71.2833
2       False  26.0   yes   True  Third  NaN  Southampton        S   7.9250
3       False  35.0   yes  False  First    C  Southampton        S  53.1000
4        True  35.0    no   True  Third  NaN  Southampton        S   8.0500

   parch  pclass     sex  sibsp  survived    who
0      0       3    male      1         0    man
1      0       1  female      1         1  woman
2      0       3  female      0         1  woman
3      0       1  female      1         1  woman
4      0       3    male      0         0    man
   alone alive  embark_town deck  adult_male    who  class embarked     fare  \
0  False    no  Southampton  NaN        True    man  Third        S   7.2500
1  False   yes    Cherbourg    C       False  woman  First        C  71.2833
2   True   yes  Southampton  NaN       False  woman  Third        S   7.9250
3  False   yes  Southampton    C       False  woman  First        S  53.1000
4   True    no  Southampton  NaN        True    man  Third        S   8.0500

   parch  sibsp   age     sex  pclass  survived
0      0      1  22.0    male       3         0
1      0      1  38.0  female       1         1
2      0      0  26.0  female       3         1
3      0      1  35.0  female       1         1
4      0      0  35.0    male       3         0
   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0